Revit 2027 API
MEPAnalyticalModelData.GetSegmentById Method
 Gets the analytical segment with the specified id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalSegment GetSegmentById(
	int segmentId
)
Public Function GetSegmentById (
	segmentId As Integer
) As MEPAnalyticalSegment
public:
MEPAnalyticalSegment^ GetSegmentById(
	int segmentId
)
member GetSegmentById :
        segmentId : int -> MEPAnalyticalSegment
Parameters
segmentId Int32
 The segment id to be retrieved. This id is not 0 based.
Return Value
MEPAnalyticalSegment
 The returned analytical segment.
Exceptions
Exception | Condition
ArgumentException |  The input must be a valid segment id.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace